casoTemplate/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1e-6;

boundaryField
{
    lateral
    {
        type            zeroGradient;
	//value           uniform 0;
    }
    
    top
    {
        type            zeroGradient;
	//value           uniform 0;
    }

    bottom
    {
        type            compressible::alphatWallFunction;
	Prt             0.85;
	value           uniform 1e-6;
    }
}

// ************************************************************************* //
