casoTemplate/0/include.snapy/lateral01U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral01
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        309
        (
            (  5.8093  15.2162   0.5198)
            (  5.8236  15.1714   0.4257)
            (  5.7654  15.1946   0.3939)
            (  5.7559  15.1008   0.3066)
            (  5.5287  15.1161   0.3016)
            (  5.1983  15.6361   0.6869)
            (  4.9876  15.5668   0.5567)
            (  4.7979  15.3701   0.3348)
...
        );
    }
