casoTemplate/0/include.snapy/lateral02U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral02
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        291
        (
            (  5.1836  15.3259   0.3574)
            (  4.7171  15.5987   0.3803)
            (  3.9658  15.2909   0.1592)
            (  3.4267  15.5398   0.2023)
            (  3.3820  15.6258   0.3335)
            (  3.2159  15.7222   0.4789)
            (  3.1592  15.6216   0.6058)
            (  3.0354  16.5389  -0.0951)
...
        );
    }
