casoTemplate/0/include.snapy/lateral03U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral03
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        311
        (
            (  3.0707  14.8068   0.3035)
            (  2.9666  14.6455   0.4088)
            (  1.5561  14.2626   0.8712)
            (  0.2699  14.1741   1.1970)
            ( -0.9541  13.6921   1.3726)
            ( -1.1696  12.2080   1.3132)
            ( -0.1238  10.6814   1.1478)
            (  1.3926   8.9715   0.9838)
...
        );
    }
