casoTemplate/0/include.snapy/lateral04U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral04
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        268
        (
            (  4.4202  13.5701   0.4728)
            (  3.6610  12.7087   0.8020)
            (  2.0948  11.4942   1.1943)
            (  0.5834  10.2438   1.4778)
            ( -0.3346   9.4754   1.6841)
            ( -0.3341   8.9116   1.7754)
            (  0.2910   8.3704   1.7419)
            (  0.8641   7.7853   1.5965)
...
        );
    }
