casoTemplate/0/include.snapy/lateral05U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral05
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        278
        (
            (  4.4319  12.9944   1.0647)
            (  2.9576  10.7232   1.2011)
            (  0.7925   7.7490   1.2334)
            ( -0.2617   6.4147   1.1851)
            ( -0.3061   6.3596   1.1734)
            (  0.7599   6.9501   1.0302)
            (  1.8749   7.1034   0.7586)
            (  2.8969   7.2063   0.6045)
...
        );
    }
