casoTemplate/0/include.snapy/lateral06U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral06
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        337
        (
            (  4.1027  11.8369  -0.2135)
            (  3.1817   7.7987  -0.0252)
            (  0.7989   5.2737   0.2139)
            ( -0.1017   4.9538   0.1962)
            (  0.2659   5.1373   0.0655)
            (  0.3829   5.2136  -0.1084)
            (  1.1201   5.9050  -0.5992)
            (  2.0184   6.7059  -0.4417)
...
        );
    }
