casoTemplate/0/include.snapy/lateral07U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral07
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        297
        (
            (  3.9648  15.0635  -1.7831)
            (  4.0402  15.1510  -1.1185)
            (  4.2081  15.2068  -0.4303)
            (  3.2564  15.1665  -1.7210)
            (  3.6440  14.9914  -0.9316)
            (  3.8084  15.1266  -0.4904)
            (  3.9794  15.0697  -0.1974)
            (  4.0896  14.9524  -0.1413)
...
        );
    }
