casoTemplate/0/include.snapy/lateral08U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral08
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        314
        (
            (  4.6023  14.8807  -2.8367)
            (  3.8904  15.3160  -3.5940)
            (  3.5654  15.1424  -2.6061)
            (  4.3071  16.4202  -2.7872)
            (  3.5698  16.1806  -3.2744)
            (  2.7629  15.7889  -3.7697)
            (  2.6789  14.8636  -3.2842)
            (  3.3077  13.8899  -2.3997)
...
        );
    }
