casoTemplate/0/include.snapy/lateral09U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral09
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        304
        (
            (  3.5942  12.3437   2.9312)
            (  3.6512  12.7856   1.8622)
            (  3.7530  13.2953   1.0475)
            (  3.7672  13.7771   0.4773)
            (  3.6929  13.6675   2.8812)
            (  4.5851  14.6910   2.5268)
            (  5.4103  15.8720   2.1177)
            (  5.8166  16.1651   0.1656)
...
        );
    }
