casoTemplate/0/include.snapy/lateral10U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral10
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        297
        (
            (  3.6572   8.7701   0.9906)
            (  3.6312   8.7868   1.3976)
            (  3.8601   8.5981   1.7770)
            (  3.6647   8.6120   1.6725)
            (  3.2426  10.3679   1.5898)
            (  3.3669  10.4359   1.9989)
            (  3.4494  11.0024   2.3697)
            (  3.5941  11.4480   2.7979)
...
        );
    }
