casoTemplate/0/include.snapy/lateral11U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral11
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        303
        (
            (  3.7086   8.7363   0.9581)
            (  3.3952   9.1489   1.3187)
            (  3.2696  10.3378   1.3913)
            (  2.5751  10.5669   1.0641)
            (  1.7953  10.8481   0.7553)
            (  1.2926  10.4826   0.4780)
            (  1.6521   9.3799   0.2427)
            (  2.1157   8.3814   0.0533)
...
        );
    }
