casoTemplate/0/include.snapy/lateral12U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral12
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        336
        (
            (  4.0694  10.9834   0.2613)
            (  3.7271   9.6470   0.8036)
            (  4.5694  11.3255   0.8178)
            (  4.5033  11.4391   0.6063)
            (  3.8132  11.4667   0.3548)
            (  2.7288  11.5841   0.1456)
            (  1.9427  11.0087  -0.0763)
            (  1.5927   9.5603  -0.2681)
...
        );
    }
