casoTemplate/0/include.snapy/lateral13U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral13
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        288
        (
            (  6.4198  11.9348  -0.2453)
            (  7.0430  13.6805  -0.3158)
            (  6.0682  12.8852  -0.4376)
            (  4.6022  12.8482  -0.4476)
            (  3.5638  12.5403  -0.4754)
            (  2.9277  10.4266  -0.5839)
            (  1.9877   8.6486  -0.7748)
            (  0.8799   8.5523  -0.9698)
...
        );
    }
