casoTemplate/0/include.snapy/lateral14U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral14
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        315
        (
            (  5.5696  14.8782  -0.9130)
            (  4.1999  16.0867  -0.9470)
            (  2.7316  15.2706  -0.8036)
            (  1.7471  12.5989  -0.6183)
            (  0.6302  10.7067  -0.4029)
            ( -0.3069  10.6658  -0.2142)
            (  0.6375  10.5609  -0.4264)
            (  1.3542  10.2338  -0.5128)
...
        );
    }
