casoTemplate/0/include.snapy/lateral15U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral15
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        296
        (
            (  4.6147  18.1813   0.2455)
            (  4.7020  18.5108   0.2792)
            (  4.1069  19.6264   0.0529)
            (  4.3055  19.7093   0.0829)
            (  4.4237  19.9541   0.2916)
            (  4.4064  20.3648   0.6720)
            (  3.0586  18.7820  -0.3783)
            (  3.4255  18.8237  -0.2993)
...
        );
    }
