casoTemplate/0/include.snapy/lateral16U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
            lateral16
    {
        type            freestream;        freestreamValue nonuniform List<vector>
        328
        (
            (  6.0583  15.4066   0.5916)
            (  5.8969  15.3481   0.5534)
            (  5.7102  15.8323   0.7308)
            (  5.4853  15.7260   0.7517)
            (  5.3419  15.6347   0.7259)
            (  5.0063  16.8884   0.7978)
            (  4.7651  16.7498   0.7225)
            (  4.6049  16.6299   0.7275)
...
        );
    }
